/**~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
＊　ファイル名： ssd1306.h
＊　内容　　　：OLED(SSD1306)ダブルバッファドライバ
＊　作成日　　： 2018/5/4
＊　作成者　　： kern-gt

		Encoding：UTF-8
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~**/
#ifndef _OLED_SSD1306_H_
#define _OLED_SSD1306_H_

#include "ssd1306_common.h"
/**----------------------------------------------------------------------------
<<外部公開マクロ定義>>
-----------------------------------------------------------------------------**/

/**----------------------------------------------------------------------------
<<外部公開型定義>>
-----------------------------------------------------------------------------**/

/**----------------------------------------------------------------------------
<<外部公開プロトタイプ定義>>
-----------------------------------------------------------------------------**/
/*extern*/
extern void InitSSD1306(void);
extern void InitGramHandleSSD1306(SSD1306GramHandle_t *handle_p, eDispLayDeviceID disp_dev_id);
extern void SwapBuffersSSD1306(SSD1306GramHandle_t *handle_p);
extern void DisplayOnSSD1306(eDispLayDeviceID disp_dev_id);
extern void DisplayOffSSD1306(eDispLayDeviceID disp_dev_id);
extern void Draw(void);
#endif /* _OLED_SSD1306_H_ */